Revit 2027 API
ScheduleDefinition.InsertCombinedParameterField Method
 Adds a combined parameter field at the specified position in the list.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleField InsertCombinedParameterField(
	IList<TableCellCombinedParameterData> data,
	string fieldName,
	int index
)
Public Function InsertCombinedParameterField (
	data As IList(Of TableCellCombinedParameterData),
	fieldName As String,
	index As Integer
) As ScheduleField
public:
ScheduleField^ InsertCombinedParameterField(
	IList<TableCellCombinedParameterData^>^ data,
	String^ fieldName,
	int index
)
member InsertCombinedParameterField :
        data : IList<TableCellCombinedParameterData> *
        fieldName : string *
        index : int -> ScheduleField
Parameters
data IList<TableCellCombinedParameterData>
 The combined parameters array.
fieldName String
 The field name.
index Int32
 The index in the list of fields.
Return Value
ScheduleField
 The new field.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  index is not a valid insert position.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace